src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <owners>Catalog.ЮрФиз</owners>
  <attributes>
    <name>телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>емайл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮрФизЛицо</name>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ЮрФиз/ЮрФиз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЮрФиз</name>
  <predefined>
    <items>
      <name>ФизЛицо</name>
      <description>FL</description>
    </items>
    <items>
      <name>ЮрЛицо</name>
      <description>UL</description>
    </items>
  </predefined>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Контрагенты/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	if ОбменДанными.Загрузка then
		return;
	endif;
	
	if not ValueIsFilled(Owner) then
		Owner = Справочники.ЮрФиз.ФизЛицо;
	endif;
	
	if Owner = Справочники.ЮрФиз.ФизЛицо then
		
		ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
		
	elsif Owner = Справочники.ЮрФиз.ЮрЛицо then
		
		ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
		
	endif;	
КонецПроцедуры
